app/controllers/albums_controller.rb

SELECT "bands".* FROM "bands"
---
  def new
    @bands = Band.all

INSERT INTO "albums" ("title", "live", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "another album"], ["live", true], ["band_id", 9], ["created_at", "2018-12-20 22:17:29.134434"], ["updated_at", "2018-12-20 22:17:29.134434"]]
---
  def create
    album = Album.new(album_params)
    if album.save