app/controllers/bands_controller.rb

  def update
    @band = Band.find(params[:id])
    @band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "another band edited"], ["updated_at", "2018-12-20 19:57:01.168877"], ["id", 7]]

  def destroy
    band = Band.find(params[:id])
    band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 5]]