app/models/user.rb

  def reset_session_token!
    self.update!(session_token: self.class.generate_session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "wuUWbjUuyYdwd8ziizepPQ"], ["updated_at", "2018-12-20 17:12:00.992833"], ["id", 1]]